{
  "perf-audit-where-do-i-start-p3.html": {
    "title": "ASKTHEINDUSTRY 24: I want to audit the performance of my website, where do I start? (part 3)",
    "preview": "In this last part, I’m giving you a bullet list of every step I take when going for runtime discoveries. Two days ago we established two types of perf audits and said that one can focus on either loadtime or runtime. Today let’s see an actionable list of steps that you can take on your website right now.",
    "date": "09/03/2017",
    "keywords": "PERF AUDIT"
  },
  "perf-audit-where-do-i-start-p2.html": {
    "title": "ASKTHEINDUSTRY 23: I want to audit the performance of my website, where do I start? (part 2)",
    "preview": "I’ll address the more practical side of it, giving you a bullet list of every step I take when going for loadtime discoveries. Yesterday we established two types of perf audits and said that one can focus on either loadtime or runtime. Today let’s see an actionable list of steps that you can take on your website today.",
    "date": "08/03/2017",
    "keywords": "PERF AUDIT"
  },
  "perf-audit-where-do-i-start-p1.html": {
    "title": "ASKTHEINDUSTRY 22: I want to audit the performance of my website, where do I start? (part 1)",
    "preview": "I see this one a lot. More and more people in the web development industry are beginning to see the incredible convenience of having a fast-loading website. It's good for the users, it's good for conversions, it's good for the numbers, it's good for everybody. Reasonably, developers are starting to approach this topic. What's in an audit? How do I start? Is there a single way to go about it, or are there many?",
    "date": "07/03/2017",
    "keywords": "PERF AUDIT"
  },
  "blocking-css.html": {
    "title": "The single most effective technique I employ to fix a slow First Paint",
    "preview": "Recently I shared the most effective technique I end up relying on, when fixing a slow First Paint. It is not mind blowing, it is not novel, and it is certainly not complicated. Still, that’s what I spend most of my time doing, so I decided to expand a little bit more",
    "date": "15/01/2017",
    "keywords": "PERF CSS"
  },
  "fonts-strat.html": {
    "title": "How I dropped 1s from the First Paint with a smarter font loading strategy",
    "preview": "I've been learning a lot about measuring performance recently. As an exercise, I measured the Time to First Paint for our website on a Moto G on a 3G connection (thanks WebPageTest) which was pretty upsetting. As I started investigating more on the causes, I've found out about two innocent realities that I've never considered before about Web Fonts",
    "date": "03/01/2017",
    "keywords": "PERF FONTS"
  },
  "perf-metrics.html": {
    "title": "Measuring performance: page load",
    "preview": "When approaching performance, you need to start with profiling. The first thing you want to do is identifying the problem: since finding what's wrong is always the first step of making it right. That's why measuring is so important when it comes to page load performance, if you don't have metrics to compare, you don't have a measure of success.",
    "date": "16/12/2016",
    "keywords": "PERF METRICS"
  },
  "60fps-animations.html": {
    "title": "60fps animations on the Web",
    "preview": "I want you to listen to me. You cannot animate whichever CSS property you'd wish to transition carelessly. However, 60fps can be achieved on the Web. Let's see what we can do to start helping to make the Web a better (and smoother) place.",
    "date": "10/12/2016",
    "keywords": "PERF ANIMATIONS"
  },
  "conditional-polyfills.html": {
    "title": "Features support: polyfills and conditional loading",
    "preview": "New features of the Web Platform are enticing and appealing to developers, but sooner or later we all crash against the Cross Browser Compatibility Wall. Should we give up on the shiny new features and wait on browsers to catch up? Hell no we shouldn't! Polyfills to the rescue.",
    "date": "02/12/2016",
    "keywords": "BLEEDING EDGE"
  },
  "image-inlining-element.html": {
    "title": "The performance of images: a Custom Element",
    "preview": "This is the second part of our series on the performance of images, in the following we will be building a Custom Element implementing the inlining technique outlined earlier.",
    "date": "25/11/2016",
    "keywords": "PERF IMAGES"
  },
  "image-inlining.html": {
    "title": "The performance of images: inlining",
    "preview": "Pictures are an integral part of the web experience, but can sometimes be slow to display, especially on mobile networks. Can we make the loading of an image be perceived as instantaneous?",
    "date": "12/11/2016",
    "keywords": "PERF IMAGES"
  },
  "gzip.html": {
    "title": "Your minification is not enough",
    "preview": "Gzip is a compression algorithm which works at its best when run against textual files. Let me show you how it works and why I believe minification can be just not enough.",
    "date": "06/09/2016",
    "keywords": "PERF COMPRESSION"
  }
}